In [1]:
!pip install pandas
!pip install numpy

Requirement already satisfied: pandas in ./.venv/lib/python3.11/site-packages (2.2.2)
Requirement already satisfied: numpy>=1.23.2 in ./.venv/lib/python3.11/site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in ./.venv/lib/python3.11/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in ./.venv/lib/python3.11/site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in ./.venv/lib/python3.11/site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in ./.venv/lib/python3.11/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Requirement already satisfied: numpy in ./.venv/lib/python3.11/site-packages (1.26.4)

In [2]:
import pandas as pd

# Check Pandas version

In [3]:
pd.__version__

'2.2.2'

# How to create Series

In [4]:
df = pd.Series([1,2,3,4,5])
df

0    1
1    2
2    3
3    4
4    5
dtype: int64

# How to check Shape

In [5]:
df.shape

(5,)

# How to create DataFrame

In [6]:
df = pd.DataFrame({"firstName": ["Vimal", "Krishiv"], "lastName": ["Menon", "Menon"], "age":[38,1]})
df

  firstName lastName  age
0     Vimal    Menon   38
1   Krishiv    Menon    1

# How to check Shape

In [7]:
df.shape

(2, 3)

# How to load JSON data

In [8]:
dict_data = [
    {
        "firstName": "Vimal",
        "lastName": "Menon",
        "age": 38
    },
    {
        "firstName": "Krishiv",
        "lastName": "Menon",
        "age": 1
    }
]
dict_data

[{'firstName': 'Vimal', 'lastName': 'Menon', 'age': 38},
 {'firstName': 'Krishiv', 'lastName': 'Menon', 'age': 1}]

In [9]:
df = pd.json_normalize(dict_data)
df

  firstName lastName  age
0     Vimal    Menon   38
1   Krishiv    Menon    1

In [10]:
pd.DataFrame({"Name": ["Vimal Menon", "Krishiv Menon"],"Age":[39, 1.5]})

            Name   Age
0    Vimal Menon  39.0
1  Krishiv Menon   1.5